service/src/test/resources/soap-request-xml/getServiceVersionTriggerFault.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:get="http://www.tcf.org.nz/v0.0.1/bif/getVersion" xmlns:mdh="http://www.tcf.org.nz/v0.0.1/bif/MessageDiagnosticHeader">
	<soapenv:Header>
		<mdh:messageDiagnosticHeader URI="#89c73bee-e168-433b-85f5-1383387ae6da">
			<diagnosticHeaderId>2255ee03-1c25-4a47-9aef-010dabcc9f20
			</diagnosticHeaderId>
			<conversationId>09e9294a-baa4-4aa3-99f3-98f7c96d8fa1</conversationId>
			<createdDateTime>2014-03-04T13:45:28.944+13:00</createdDateTime>
			<conversationId>123</conversationId>
			<fromPartyId>RSP_A</fromPartyId>
			<toPartyId>LFC_B</toPartyId>
		</mdh:messageDiagnosticHeader>
	</soapenv:Header>
	<soapenv:Body mdh:Id="89c73bee-e168-433b-85f5-1383387ae6da">
		<get:GetServiceVersionDetailsRequest>
			<soapAction>TRIGGER_SAMPLE_FAULT</soapAction>
		</get:GetServiceVersionDetailsRequest>
	</soapenv:Body>
</soapenv:Envelope>